SIR/src/main/resources/consultaDeuda.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.ws.latam.ndt.cl/"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-EEF3E721B2FE6E31DC15736520082861"><wsse:Username>#USERNAME#</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">#PASSWORD#</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><web:consultaDeuda><request><id_empresa>#ID#</id_empresa><tipo_busqueda>#BUSQUEDA#</tipo_busqueda><valor_busqueda>#NUMERO#</valor_busqueda><cod_recaudador>#RECAUDADOR#</cod_recaudador><cred_recaudador>#CRED#</cred_recaudador><cod_oficina_recaudador>#OF#</cod_oficina_recaudador><cod_caja_recaudador>#CAJA#</cod_caja_recaudador></request></web:consultaDeuda></soapenv:Body></soapenv:Envelope>